import bro_1 from "../assets/blog/subblog/bro_1.webp";

import bro_2 from "../assets/blog/subblog/bro_2.webp";

import bro_3 from "../assets/blog/subblog/bro_3.webp";

const products = [
  { 
    productId: `mvp`,
    src: "https://www.youtube.com/embed/2mPSXP3oT5E",

    title:"Как протестировать свою бизнес идею, продукт или функционал? Про MVP подход в работе",

    num:"0",
    allow:"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture",
    name:"Как тестировать идеи и работать быстро?",
    name2:"Как тестировать идеи и работать?",
    text:"Поговорим об MVP подходе, который мы используем в процессе проработки продукта и добавления нового функционала.",        
    
    

    user: "Элчибек Аманбеков",   
    spec: "Product Manager",

    firstText: "Сегодня я бы хотел поговорить об MVP подходе, который мы используем в процессе проработки продукта и добавления нового функционала.",

    question: "И так, что же такое MVP?",
    secondText: "MVP (minimum viable product) - минимально жизнеспособный продукт - это версия продукта с минимальным количеством функций, которая может решать определенную проблему пользователя. Вообще главная задача MVP - это, при минимальных инвестициях времени и денег, проверить гипотезу, лежащую в основе бизнес модели.",
    instance: "Приведем пример:",
    thirdText: " Вы хотите запустить магазин кроссовок. Вам не обязательно арендовать бутик, нанимать продавцов, да и сами кроссовки особо не понадобятся. Вместо этого вы можете создать страницу магазина в соцсетях, оформить её, выложить фото предполагаемых продуктов и пустить таргетированную рекламу. В процессе этой рекламы вы поймёте пользуется ли ваш товар спросом или нет. Вы можете собрать заявки на заказ вашей продукции и понять работает ли эта бизнес модель или нет. В случае, если вы получите мало заявок, вы сможете сделать вывод, что нужно менять бизнес модель либо перестать этим заниматься. Это сэкономит вам время и остальные ресурсы.",
    fourthText: "Концепт MVP основан на философии бережливого стартапа, описанного в книге Эрика Риса - Lean Startup. Концепт подразумевает собой цикличный процесс - построение, измерение, обучение. Этот цикл продолжается вплоть до того времени, когда продукт не начнет удовлетворять потребности рынка.Мы, в Mancho Devs, проверяем гипотезы основываясь на данных о том, так наши продукты используют пользователи, благодаря этому мы улучшаем наш продукт.",
    question2: "Как разработать MVP?",
    list1: "Определить проблему, которую решает наш продукт.",
    list2: "Провезти анализ рынка и пообщаться с потенциальными клиентами.",
    list3: "Создать список основных функций (1-2 функции)",
    list4: "Реализовать эти функции в виде MVP",

    fivth: "После этого можно выпускать MVP и наблюдать как им пользуются люди. Собрав отзывы пользователей и данные об успехах MVP, мы можем, опираясь на эти данные, поменять бизнес модель или улучшить продукт.",
    sixth: "Как вы уже увидели, этот подход можно использовать не только в айти сфере. Вы можете пройтись по шагам, описанным выше, реализовать первоначальную версию продукта. И если она будет пользоваться спросом, решать проблемы пользователей и получать положительные отзывы - значит пора масштабироваться и выпускать полноценную версию продукта с добавлением нового функционала.",
    bro_1: bro_1,
  },
  {
    bro_1: bro_2,
    productId: `designdrivendev`,
    src:"https://www.youtube.com/embed/x1CkwfoC4Nc",
    title:"Как протестировать свою бизнес идею, продукт или функционал? Про MVP подход в работе",
    num:"0",
    allow:"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture",
    name:"Что такое Design-Driven Development или почему наш первый сотрудник дизайнер",
    text:"В нашей работе мы используем принцип, который называется Design Driven Development. Что это такое?",

    // name2: "sdgf",
    user: "Улан Джакыпов",   
    spec: "UI/UX дизайнер",
    firstText: "В нашей работе мы используем принцип, который называется Design Driven Development. Что это такое? Это процесс, при котором дизайн и опыт взаимодействия пользователя с продуктом определяют наши задачи. То есть, другими словами, сначала мы создаём дизайн и только после этого передаём его в разработку.",
    // question: "И так, что же такое MVP?",
    secondText: "Мы не приступаем к разработке пока не отшлифуем дизайн, так как хотим создавать продукты, о которых пользователи сами будут рассказывать своим друзьям и знакомым.",

    // instance: "Приведем пример:",
    // thirdText: " Вы хотите запустить магазин кроссовок. Вам не обязательно арендовать бутик, нанимать продавцов, да и сами кроссовки особо не понадобятся. Вместо этого вы можете создать страницу магазина в соцсетях, оформить её, выложить фото предполагаемых продуктов и пустить таргетированную рекламу. В процессе этой рекламы вы поймёте пользуется ли ваш товар спросом или нет. Вы можете собрать заявки на заказ вашей продукции и понять работает ли эта бизнес модель или нет. В случае, если вы получите мало заявок, вы сможете сделать вывод, что нужно менять бизнес модель либо перестать этим заниматься. Это сэкономит вам время и остальные ресурсы.",
    // fourthText: "Концепт MVP основан на философии бережливого стартапа, описанного в книге Эрика Риса - Lean Startup. Концепт подразумевает собой цикличный процесс - построение, измерение, обучение. Этот цикл продолжается вплоть до того времени, когда продукт не начнет удовлетворять потребности рынка.Мы, в Mancho Devs, проверяем гипотезы основываясь на данных о том, так наши продукты используют пользователи, благодаря этому мы улучшаем наш продукт.",
    question2: "Как это происходит?",

    list1: "В начале мы пытаемся понять и определить проблему, с которой сталкиваются наши пользователи: в жизни, при использовании других продуктов или же при использовании наших продуктов.",
    list2: "После этого мы вместе со всей командой генерируем идеи для решения проблемы.",
    list3: "Извлекаем одно наиболее подходящее решение и делаем на его основе простой и быстрый дизайн. Далее мы шлифуем UI и готовим его рабочий прототип.",

    list4: "Демонстрируем, тестируем, получаем обратную связь и на основе комментариев улучшаем дизайн. И так мы делаем несколько раз. Это называется итеративный или повторяющийся процесс.",

    fivth: "И только потом мы передаём дизайн нашим разработчикам. Во-первых, это облегчает работу нашим разработчикам. Во-вторых, это ускоряет процесс разработки продукта. Разработчики не теряют время на обдумывание дизайна.",

    sixth: "Цель такого подхода в том, чтобы создать красивый, удобный и, самое главное, полезный и ориентированный, в первую очередь, на пользователя продукт. Таким образом, в нашей компании именно дизайн диктует наши задачи.",
  },
  {
    bro_1: bro_3,
    productId: `agileart`,

    src:"https://www.youtube.com/embed/kI-s4Gix1eg",
    title:"Как протестировать свою бизнес идею, продукт или функционал? Про MVP подход в работе",
    num:"0",
    allow:"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture",
    name:"Работа над проектами по Agile",
    
    text:"Работать над проектами хаотично, без четкой системы не очень эффективно. Тут к нам на помощь приходит Agile.",      
    name2: "Работа над проектами по Agile...",        
    user: "Арген Дарманов",   
    spec: "Project Manage",
    // firstText: "Сегодня я бы хотел поговорить об MVP подходе, который мы используем в процессе проработки продукта и добавления нового функционала.",
    question: "Цель ",
    secondText: "У каждой команды есть цель - проект который должен получиться качественным, востребованным и быть готовым в срок.",
    // instance: "Приведем пример:",
    thirdText: " Представьте, что ваша цель это гора и ваша команда отправляется в поход через большой тернистый лес, чтобы до неё добраться. Чтобы в конце пути с ужасом не обнаружить что мы оказались совсем не на той горе, во время похода, мы периодически должны проверять, с помощью компаса или карты, в правильном ли направлении мы движемся и корректировать свой маршрут. Ведь чем раньше мы поймём, что не туда идем, тем легче и быстрее будет вернуться на верную дорожку.",

    fourthText: "Так и в работе с проектом. Координироваться нам помогает система Agile или же Scrum. ",

    question2: "Каждая неделя - это спринт.",

    list1: "Мы берём определенный объем задач на спринт и всю неделю работаем над ним.",

    list2: "В конце спринта мы показываем результат (дизайн, новый функционал и т.п.) заказчикам, пользователям, менеджерам и получаем от них отзыв.",

    list3: "На основе отзывов мы понимаем где и как нам стоит подкорректировать наш маршрут, и планируем следующий спринт.",

    list4: "Tаким образом мы всегда уверены что идём в правильном направлении.",



    fivth: "Самостоятельность командыА что если у команды в какой-то момент не окажется лидера или координатора? Это не окажется большой проблемой, ведь скрам - это свод простых четких правил: общая встреча каждую неделю, получение отзывов, планирование следующего спринта. Следуя им, команда доберется до цели даже без менеджера.",
    
    sixth: "Правильная нагрузка на команду Конечно же нельзя идти в поход с пустыми руками, обязательно понадобится брать с собой какие-либо приборы, принадлежности или экипировку. Какие-то из этих вещей более тяжёлые или важные, а какие-то - наоборот менее. Всю эту нагрузку надо распределить между членами команды так, чтобы каждый благополучно добрался до цели. С этим нам так же помогает Scrum, ведь в этой системе задачи также имеюе свой вес и сложность и соответствующе распределяются между членами команды. Как вы видите эта система очень способствует успешному продвижению проектов, так что советуем к ней присмотреться.",

    name3: "About Agile",
  },
];

export function getProducts(params) {
  return products;
}

export function getProduct(productId) {
  return products [
    products.findIndex(
      product => product.productId === productId
    )
  ];
}